Autodesk.Revit.DB.ImageFileType
This enum is used to define exported file type.
Since:
2011

Autodesk.Revit.DB.ImageFileType.TIFF
TIFF

Autodesk.Revit.DB.ImageFileType.TARGA
TARGA

Autodesk.Revit.DB.ImageFileType.PNG
PNG

Autodesk.Revit.DB.ImageFileType.JPEGSmallest
JPEG with lower quality picture and small file size

Autodesk.Revit.DB.ImageFileType.JPEGMedium
JPEG with medium quality picture

Autodesk.Revit.DB.ImageFileType.JPEGLossless
JPEG with high quality picture

Autodesk.Revit.DB.ImageFileType.BMP
BMP